{
    "bio": "I was born and raised in Columbia, Missouri. After graduating high school, I started the computer science degree program with a minor in history at the Missouri University of Science and Technology (MST or S&T) in Rolla, Missouri. At the end of my sophomore year, I realized I, like many other S&T students, would take longer than 4 years to graduate. With this realization, I decided to turn my history minor into a second major using the newly created Bachelor of Science in History. I finished both programs in December of 2022, also earning an undergraduate certificate in security studies and an undergraduate certificate in war and society.",
    "why_hist": "I am commonly asked why I decided to dual major in two drastically different subjects. The simplest answer is that I wanted to. I have had a passion for learning about history, particularly 20th century history, since elementary school. While I love learning about history, I did not necessarily want to pursue a career in the field. Those that do have my utmost respect. My history degree was for my own feeling of accomplishment and evidence that I am not just a \"history buff,\" but someone capable of genuine study in and understanding of the history field.",
    "why_cs": "I decided to pursue a degree and a career in computer science my senior year of high school, but the roots of this decision go back another 2 years to my time in a Columbia Area Career Center course in digital media. There was a very brief unit on web design that exposed me to html and css for the first time. I was surprised by how much I enjoyed this very brief unit and there just so happened to be an introduction to programming course directly next door at the same time from the Career Center. With this exposure, I made sure I would try the programming course before I graduated high school. This course is what made me decide to pursue computer science. While it did not come to me as naturally as some other subjects, particularly history, I found the challenge entertaining. The satisfaction I got from seeing my C++ compile and function after spending so much time writing and debugging was comparable to the satisfaction of finding a novel solution to a video game puzzle. Even after years of studying computer science and countless programming assignments, I still get that satisfied smile from overcoming an obstacle and seeing my creation work properly.",
    "evo_key": "One of the last assignments I completed as a student was for my evolutionary computing class. The premise of the assignment was to make a new keyboard layout that was more efficient than current layouts. As a class, we determined how the keyboard would be represented and how individual layouts would be evaluated. This ensured that the assignment could be graded uniformly while the mutation and recombination operations were handled entirely by students. I decided to go about recombination by splitting the keyboard into left and right hands and having the child inherit either the left or right hand entirely and mixing the parents for the other hand. This allowed an effective layout in one hand the opportunity to persist into the next generation while still recombining and changing. Mutation was handled as a simple swap between two keys.",
    "psych": "One of my roommates sent me a link to the Right Wing Authoritarianism scale, but the scale had 34 questions and needed to be graded by hand. This seemed tedious, so instead of grading my answers by hand, I took to python to make a command line tool to present the questions and grade my responses for me. My roommate then sent me another scale, the Modern Racism Scale. While this test was significantly shorter at only eight questions, it was trivial to add to my command line tool. With one more scale added, I decided to make a simple menu that allowed users to select which tests they would like to take and present them with each. This project is what inspired the \"Scales\" page of this site, as I wanted to make a more accessible version that did not require the command line.",
    "data_mine": "The final project for my Data Mining course was to, as a pair, utilize the tools and algorithms covered over the semester to analyze a provided dataset and write a report on our findings. The first step in the process was to clean the dataset using python and pandas. Utilizing the Weka application, we ran the cleaned dataset through multiple data mining algorithms, including various SVMs, KD-Tree, PRISM, K2 Bayesian Network, CART, Naive Bayesian Network, Gradient Boosting Machine, and Stacking. Our report detailed our method and our findings on the relationships between the decision attribute and other attributes in the dataset.",
    "fizzbuzz": "One of the ways I test my capacity in a new language is by making a simple fizzbuzz program in the language. Fizzbuzz is a simple problem in which the numbers 1 through 100 must be printed but for every number that is divisible by three, \"fizz\" is printed instead, numbers divisible by five have \"buzz\" printed, and numbers divisible by both have \"fizzbuzz\" printed. This prompt can be easily changed to include a different range, different words or phrases, or different numbers for the divisible checks. This gives me a chance to self assess my basic skills in the language, particularly loops, conditional statements, and functions.",
    "unity": "My next project is to make a turn-based strategy game in Unity. I am currently in the process of learning Unity and improving my C# as a result.",
    "evo_alg": "Lots of sample text to try to find out if the gradient is actually working or not",
    "game_dev": "game_dev",
    "ui_dev": "ui_dev",
    "dig_for": "digital forensics",
    "mining": "mining",
    "crypto": "cryptography"
}