{
    "tincan_title": "The Last Stand of the Tin Can Sailors",
    "tincan_author": "James D. Hornfischer",
    "tincan_rec": "This book tells the improbable story of the Battle off Samar. During the Liberation of the Philippines, task group Taffy 3 was charged with supporting the Army's landings and invasion on the Philippine island of Leyte while Admiral Halsey took the bulk of his fleet to chase after a diversion. As a result, the outnumbered and outgunned Americans of Taffy 3 were left to fend off the largest fleet the Japanese had fielded since the Battle of Midway in June 1942. This battle is among my favorite historical tales. It's an underdog story filled with unmatched bravery that feels far too much like a Hollywood film to have actually occurred. I think that this battle is severely underappreciated with valorous acts on par with those from Normandy or Okinawa.",
    "fnv_title": "Fallout: New Vegas",
    "fnv_studio": "Obsidian Entertainment",
    "fnv_rec": "This is my favorite game of all time. It provides ample opportunity to roleplay as nearly any type of character, a rewarding leveling system, and an intricate, morally gray world. No one is presented as \"the good guys\" and every faction is shown to have their strengths and flaws. The combat mechanics and graphics are admittedly dated, even upon it's 2010 release, and the game can be buggy on account of the Gamebryo engine. That said, this is a game I still come back to and have a blast playing every time. The game also has an incredible modding community. The randomizer mod has had me pause the game to double over laughing. I would argue this is the best post-Black Isle Fallout game.",
    "fmab_title": "Full Metal Alchemist: Brotherhood",
    "fmab_author": "Hiromu Arakawa",
    "fmab_rec": "This, in my opinion, is one of the most well written stories out there. The main cast are all fleshed out, flawed characters with their own role to play in the narrative. It has intrigue, well animated fight scenes, and compelling world building. This show is an example of animation not being inherently a medium for children; this is a dark world built on violence and atrocity. The medium may not be for everyone, but I recommend giving this show a shot.",
    "f451_title": "Fahrenheit 451",
    "f451_author": "Ray Bradbury",
    "f451_rec": "This is my favorite novel. It was actually the only book assigned to me in high school that I was so invested in that I read ahead of the class. This classic portrays a dystopian America that fears the knowledge available in books. With books banned and building fires rendered impossible by fireproof materials, firemen are now tasked with burning books rather than putting out fires.The story follows Guy Montag, a fireman that becomes disillusioned with the job as they navigate this fundamentally different world.",
    "jakx_title": "Jak X: Combat Racing",
    "jakx_studio": "Naughty Dog",
    "jakx_rec1": "Naughty Dog’s PlayStation 2 titles were their Jak series. This series was all over the place. The first title, ",
    "jak_title": "Jak and Daxter: The Precursor Legacy,",
    "jakx_rec2": "was a kid friendly adventure game without load screens in 2001, while the sequels were edgier \"T\" rated games with swearing and guns. This game continued the mid 2000’s trend, but changed genre entirely. Rather than being an adventure game, it took the driving mechanics from the previous title and improved them to make a surprisingly good racing game. As the title implies, however, racing is only part of the formula. It utilizes an item system for weapons, defenses, and boost. Unlike similar item systems in other racing games, racers are not simply stunned by items. Their vehicles have health and are blown up once that reaches zero, respawning a few seconds later. This is the most fun I’ve had in a racing game.",
    "tlouhbo_title": "The Last of Us",
    "tlouhbo_creators": "Neil Druckmann and Craig Mazin",
    "tlouhbo_rec": "This HBO series is an adaptation of Naughty Dog’s video game of the same name. The game is one of the most beloved stories in the medium. It is an emotionally charged story about love that was a great choice for adaptation to a more passive medium. Video game adaptations have a bad reputation, but this series handles the adaptation exceptionally well. It does not take one for one from the source material, but the changes are not disruptive to the story. The narrative and characters retain the charm from the game, bringing this amazing story to millions of people that would otherwise never have picked up a controller to experience it.",
    "mcmanus_title": "Hell Before Their Very Eyes: American Soldiers Liberate Concentration Camps in Germany, April 1945",
    "mcmanus_auth": "Dr. John C. McManus",
    "mcmanus_rec": "This book is not a novel, nor is it for the squeamish. This is a historical work that covers exactly what it says in the subtitle. Dr. McManus thoroughly utilizes first hand accounts from soldiers that witnessed the liberation of Ohrdruf, Buchenwald, and/or Dachau to show the absolute horror of the Holocaust and the effect it had on the men that witnessed it. I took multiple classes with Dr. McManus and I actually highly recommend any of his works. They are all very informative on Americans at war."
}